archive/2024-03-20/tencentcloud/mysql/us-west_sysbench.log
if which sysbench > /dev/null 2>&1 ; then echo 'sysbench exists'; else curl -s https://packagecloud.io/install/repositories/akopytov/sysbench/script.rpm.sh | sudo bash && sudo yum -y install sysbench; fi
Warning: Permanently added '43.130.36.41' (ED25519) to the list of known hosts.
Detected operating system as centos/7.
Checking for curl...
Detected curl...
Downloading repository file: https://packagecloud.io/install/repositories/akopytov/sysbench/config_file.repo?os=centos&dist=7&source=script
done.
Installing pygpgme to verify GPG signatures...
Loaded plugins: fastestmirror, langpacks
Existing lock /var/run/yum.pid: another copy is running as pid 5193.
Another app is currently holding the yum lock; waiting for it to exit...
  The other application is: yum
    Memory :  42 M RSS (437 MB VSZ)
    Started: Thu Mar 21 01:17:19 2024 - 00:05 ago
    State  : Sleeping, pid: 5193
Another app is currently holding the yum lock; waiting for it to exit...
  The other application is: yum
    Memory :  42 M RSS (437 MB VSZ)
    Started: Thu Mar 21 01:17:19 2024 - 00:07 ago
    State  : Sleeping, pid: 5193
Another app is currently holding the yum lock; waiting for it to exit...
  The other application is: yum
    Memory :  45 M RSS (440 MB VSZ)
    Started: Thu Mar 21 01:17:20 2024 - 00:09 ago
    State  : Sleeping, pid: 5193
Another app is currently holding the yum lock; waiting for it to exit...
  The other application is: yum
    Memory :  48 M RSS (443 MB VSZ)
    Started: Thu Mar 21 01:17:20 2024 - 00:11 ago
    State  : Sleeping, pid: 5193
Another app is currently holding the yum lock; waiting for it to exit...
  The other application is: yum
    Memory :  70 M RSS (476 MB VSZ)
    Started: Thu Mar 21 01:17:20 2024 - 00:13 ago
    State  : Running, pid: 5193
Another app is currently holding the yum lock; waiting for it to exit...
  The other application is: yum
    Memory :  88 M RSS (494 MB VSZ)
    Started: Thu Mar 21 01:17:20 2024 - 00:15 ago
    State  : Running, pid: 5193
Another app is currently holding the yum lock; waiting for it to exit...
  The other application is: yum
    Memory :  88 M RSS (494 MB VSZ)
    Started: Thu Mar 21 01:17:20 2024 - 00:17 ago
    State  : Running, pid: 5193
Determining fastest mirrors
Retrieving key from https://packagecloud.io/akopytov/sysbench/gpgkey
Importing GPG key 0x04DCFD39:
 Userid     : "https://packagecloud.io/akopytov/sysbench-prerelease (https://packagecloud.io/docs#gpg_signing) <support@packagecloud.io>"
 Fingerprint: 9789 8d69 f99e e5ca c462 a0f8 cf10 4890 04dc fd39
 From       : https://packagecloud.io/akopytov/sysbench/gpgkey
Package pygpgme-0.3-9.el7.x86_64 already installed and latest version
Nothing to do
Installing yum-utils...
Loaded plugins: fastestmirror, langpacks
Loading mirror speeds from cached hostfile
Package yum-utils-1.1.31-54.el7_8.noarch already installed and latest version
Nothing to do
Generating yum cache for akopytov_sysbench...
Importing GPG key 0x04DCFD39:
 Userid     : "https://packagecloud.io/akopytov/sysbench-prerelease (https://packagecloud.io/docs#gpg_signing) <support@packagecloud.io>"
 Fingerprint: 9789 8d69 f99e e5ca c462 a0f8 cf10 4890 04dc fd39
 From       : https://packagecloud.io/akopytov/sysbench/gpgkey
Generating yum cache for akopytov_sysbench-source...

The repository is setup! You can now install packages.
Loaded plugins: fastestmirror, langpacks
Loading mirror speeds from cached hostfile
Resolving Dependencies
--> Running transaction check
---> Package sysbench.x86_64 0:1.0.20-1.el7 will be installed
--> Processing Dependency: libpq.so.5()(64bit) for package: sysbench-1.0.20-1.el7.x86_64
--> Running transaction check
---> Package postgresql-libs.x86_64 0:9.2.24-9.el7_9 will be installed
--> Finished Dependency Resolution

Dependencies Resolved

================================================================================
 Package             Arch       Version             Repository             Size
================================================================================
Installing:
 sysbench            x86_64     1.0.20-1.el7        akopytov_sysbench     430 k
Installing for dependencies:
 postgresql-libs     x86_64     9.2.24-9.el7_9      updates               235 k

Transaction Summary
================================================================================
Install  1 Package (+1 Dependent package)

Total download size: 665 k
Installed size: 1.8 M
Downloading packages:
--------------------------------------------------------------------------------
Total                                              481 kB/s | 665 kB  00:01
Running transaction check
Running transaction test
Transaction test succeeded
Running transaction
  Installing : postgresql-libs-9.2.24-9.el7_9.x86_64                        1/2
  Installing : sysbench-1.0.20-1.el7.x86_64                                 2/2
  Verifying  : sysbench-1.0.20-1.el7.x86_64                                 1/2
  Verifying  : postgresql-libs-9.2.24-9.el7_9.x86_64                        2/2

Installed:
  sysbench.x86_64 0:1.0.20-1.el7

Dependency Installed:
  postgresql-libs.x86_64 0:9.2.24-9.el7_9

Complete!
wait db start...
sysbench --db-driver=mysql --mysql-host=192.168.0.7 --mysql-port=3306 --mysql-user=sbtest --mysql-password=DBPassword123 --mysql-db=sbtest --table_size=10000000 --tables=10 --events=0 --threads=20 oltp_read_write prepare
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest3'...
Creating table 'sbtest5'...
Creating table 'sbtest9'...
Creating table 'sbtest6'...
Creating table 'sbtest7'...
Creating table 'sbtest2'...
Creating table 'sbtest4'...
Creating table 'sbtest10'...
Creating table 'sbtest8'...
Inserting 10000000 records into 'sbtest3'
Inserting 10000000 records into 'sbtest4'
Inserting 10000000 records into 'sbtest7'
Inserting 10000000 records into 'sbtest10'
Inserting 10000000 records into 'sbtest6'
Inserting 10000000 records into 'sbtest5'
Inserting 10000000 records into 'sbtest8'
Inserting 10000000 records into 'sbtest2'
Inserting 10000000 records into 'sbtest1'
Inserting 10000000 records into 'sbtest9'
Creating a secondary index on 'sbtest5'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest8'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest6'...
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest9'...
Creating a secondary index on 'sbtest10'...
Creating a secondary index on 'sbtest2'...
****************************** 4 threads ******************************
sysbench --db-driver=mysql --mysql-host=192.168.0.7 --mysql-port=3306 --mysql-user=sbtest --mysql-password=DBPassword123 --mysql-db=sbtest --table_size=10000000 --tables=10 --events=0 --time=360 --threads=4  --percentile=99  --report-interval=10 oltp_read_write run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 489.10 qps: 9784.61 (r/w/o: 6849.60/1956.40/978.60) lat (ms,99%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 511.11 qps: 10222.94 (r/w/o: 7156.40/2044.43/1022.11) lat (ms,99%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 509.70 qps: 10194.21 (r/w/o: 7135.94/2038.78/1019.49) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 507.29 qps: 10144.80 (r/w/o: 7100.96/2029.36/1014.48) lat (ms,99%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 504.61 qps: 10093.03 (r/w/o: 7065.46/2018.25/1009.32) lat (ms,99%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 504.60 qps: 10093.88 (r/w/o: 7065.89/2018.80/1009.20) lat (ms,99%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 501.00 qps: 10021.07 (r/w/o: 7014.78/2004.29/1002.00) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 505.10 qps: 10101.33 (r/w/o: 7071.02/2020.11/1010.20) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 509.29 qps: 10184.59 (r/w/o: 7128.85/2037.16/1018.58) lat (ms,99%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 525.10 qps: 10500.99 (r/w/o: 7350.69/2100.10/1050.20) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 519.21 qps: 10383.72 (r/w/o: 7268.55/2076.74/1038.42) lat (ms,99%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 538.50 qps: 10769.84 (r/w/o: 7538.86/2153.99/1076.99) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 4 tps: 539.11 qps: 10781.20 (r/w/o: 7546.54/2156.44/1078.22) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 4 tps: 539.59 qps: 10793.85 (r/w/o: 7556.30/2158.37/1079.19) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 4 tps: 517.80 qps: 10355.30 (r/w/o: 7248.47/2071.22/1035.61) lat (ms,99%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 4 tps: 525.69 qps: 10515.12 (r/w/o: 7360.91/2102.84/1051.37) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 4 tps: 530.11 qps: 10601.11 (r/w/o: 7420.54/2120.34/1060.22) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 4 tps: 546.20 qps: 10927.12 (r/w/o: 7649.21/2185.50/1092.40) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 4 tps: 553.09 qps: 11060.16 (r/w/o: 7742.00/2211.97/1106.19) lat (ms,99%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 4 tps: 535.41 qps: 10706.80 (r/w/o: 7494.67/2141.32/1070.81) lat (ms,99%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 4 tps: 536.80 qps: 10738.18 (r/w/o: 7516.96/2147.62/1073.61) lat (ms,99%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 4 tps: 547.48 qps: 10945.49 (r/w/o: 7661.08/2189.54/1094.87) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 4 tps: 540.71 qps: 10816.09 (r/w/o: 7571.53/2163.04/1081.52) lat (ms,99%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 4 tps: 547.40 qps: 10949.53 (r/w/o: 7665.12/2189.61/1094.80) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 4 tps: 539.49 qps: 10789.60 (r/w/o: 7552.83/2157.78/1078.99) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 4 tps: 555.10 qps: 11100.28 (r/w/o: 7769.56/2220.62/1110.11) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 4 tps: 560.00 qps: 11202.87 (r/w/o: 7842.28/2240.49/1120.10) lat (ms,99%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 4 tps: 559.70 qps: 11193.02 (r/w/o: 7835.54/2238.08/1119.39) lat (ms,99%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 4 tps: 521.30 qps: 10425.66 (r/w/o: 7297.87/2085.19/1042.60) lat (ms,99%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 4 tps: 552.21 qps: 11044.34 (r/w/o: 7731.00/2208.93/1104.41) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 4 tps: 549.61 qps: 10993.37 (r/w/o: 7695.42/2198.73/1099.22) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 4 tps: 545.39 qps: 10905.46 (r/w/o: 7633.40/2181.27/1090.79) lat (ms,99%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 4 tps: 544.69 qps: 10892.23 (r/w/o: 7624.31/2178.65/1089.27) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 4 tps: 547.22 qps: 10947.26 (r/w/o: 7663.85/2188.87/1094.54) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 4 tps: 537.80 qps: 10753.71 (r/w/o: 7526.94/2151.18/1075.59) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 4 tps: 559.98 qps: 11200.21 (r/w/o: 7840.23/2240.02/1119.96) lat (ms,99%): 9.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2681980
        write:                           766280
        other:                           383140
        total:                           3831400
    transactions:                        191570 (532.12 per sec.)
    queries:                             3831400 (10642.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          360.0094s
    total number of events:              191570

Latency (ms):
         min:                                    5.49
         avg:                                    7.51
         max:                                  112.63
         99th percentile:                       10.65
         sum:                              1439024.48

Threads fairness:
    events (avg/stddev):           47892.5000/601.59
    execution time (avg/stddev):   359.7561/0.00

****************************** 8 threads ******************************
sysbench --db-driver=mysql --mysql-host=192.168.0.7 --mysql-port=3306 --mysql-user=sbtest --mysql-password=DBPassword123 --mysql-db=sbtest --table_size=10000000 --tables=10 --events=0 --time=360 --threads=8  --percentile=99  --report-interval=10 oltp_read_write run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1049.36 qps: 20996.99 (r/w/o: 14699.33/4198.14/2099.52) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1090.44 qps: 21807.27 (r/w/o: 15265.04/4361.35/2180.88) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1090.71 qps: 21814.63 (r/w/o: 15270.59/4362.63/2181.41) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1070.59 qps: 21408.45 (r/w/o: 14984.72/4282.65/2141.07) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1068.91 qps: 21383.47 (r/w/o: 14969.72/4275.83/2137.92) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1091.47 qps: 21826.44 (r/w/o: 15278.21/4365.29/2182.94) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 1054.63 qps: 21092.12 (r/w/o: 14764.04/4218.93/2109.16) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1088.48 qps: 21773.39 (r/w/o: 15241.91/4354.42/2177.06) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 1096.22 qps: 21921.43 (r/w/o: 15344.70/4384.29/2192.44) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1058.78 qps: 21178.06 (r/w/o: 14825.19/4235.31/2117.56) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 1064.99 qps: 21298.20 (r/w/o: 14908.16/4260.06/2129.98) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 1075.82 qps: 21516.34 (r/w/o: 15061.74/4303.07/2151.53) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 8 tps: 1064.51 qps: 21290.57 (r/w/o: 14903.22/4258.23/2129.12) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 8 tps: 1100.44 qps: 22009.03 (r/w/o: 15406.18/4401.97/2200.88) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 8 tps: 1089.46 qps: 21788.34 (r/w/o: 15252.10/4357.33/2178.91) lat (ms,99%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 8 tps: 1083.60 qps: 21672.51 (r/w/o: 15170.31/4335.00/2167.20) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 8 tps: 1054.09 qps: 21079.92 (r/w/o: 14756.28/4215.46/2108.18) lat (ms,99%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 8 tps: 1061.87 qps: 21235.49 (r/w/o: 14864.17/4247.58/2123.74) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 8 tps: 1033.35 qps: 20669.28 (r/w/o: 14468.99/4133.60/2066.70) lat (ms,99%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 8 tps: 1066.10 qps: 21323.23 (r/w/o: 14926.65/4264.39/2132.19) lat (ms,99%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 8 tps: 1086.48 qps: 21729.25 (r/w/o: 15210.06/4346.33/2172.87) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 8 tps: 1077.31 qps: 21546.14 (r/w/o: 15082.50/4308.93/2154.71) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 8 tps: 1069.70 qps: 21394.27 (r/w/o: 14975.88/4278.99/2139.40) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 8 tps: 1081.51 qps: 21626.81 (r/w/o: 15138.27/4325.52/2163.01) lat (ms,99%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 8 tps: 1053.75 qps: 21074.98 (r/w/o: 14752.58/4214.90/2107.50) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 8 tps: 1050.94 qps: 21022.47 (r/w/o: 14716.64/4203.95/2101.88) lat (ms,99%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 8 tps: 1075.78 qps: 21513.09 (r/w/o: 15058.42/4303.12/2151.56) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 8 tps: 1076.11 qps: 21523.65 (r/w/o: 15067.08/4304.45/2152.13) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 8 tps: 1044.52 qps: 20894.03 (r/w/o: 14626.10/4178.79/2089.14) lat (ms,99%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 8 tps: 1077.09 qps: 21535.06 (r/w/o: 15073.40/4307.47/2154.19) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 8 tps: 1065.19 qps: 21308.45 (r/w/o: 14916.89/4261.17/2130.38) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 8 tps: 1065.89 qps: 21316.84 (r/w/o: 14921.49/4263.67/2131.68) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 8 tps: 1048.19 qps: 20962.07 (r/w/o: 14673.31/4192.27/2096.49) lat (ms,99%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 8 tps: 1075.01 qps: 21502.83 (r/w/o: 15051.86/4300.95/2150.02) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 8 tps: 1064.59 qps: 21288.73 (r/w/o: 14901.88/4257.67/2129.18) lat (ms,99%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 8 tps: 1071.52 qps: 21432.98 (r/w/o: 15003.74/4286.30/2142.95) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5395362
        write:                           1541532
        other:                           770766
        total:                           7707660
    transactions:                        385383 (1070.48 per sec.)
    queries:                             7707660 (21409.64 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          360.0070s
    total number of events:              385383

Latency (ms):
         min:                                    5.59
         avg:                                    7.47
         max:                                  107.30
         99th percentile:                       10.84
         sum:                              2878314.31

Threads fairness:
    events (avg/stddev):           48172.8750/1161.01
    execution time (avg/stddev):   359.7893/0.01

****************************** 16 threads ******************************
sysbench --db-driver=mysql --mysql-host=192.168.0.7 --mysql-port=3306 --mysql-user=sbtest --mysql-password=DBPassword123 --mysql-db=sbtest --table_size=10000000 --tables=10 --events=0 --time=360 --threads=16  --percentile=99  --report-interval=10 oltp_read_write run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1563.88 qps: 31297.03 (r/w/o: 21911.14/6256.63/3129.26) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1564.12 qps: 31277.24 (r/w/o: 21892.61/6256.39/3128.24) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1568.78 qps: 31378.84 (r/w/o: 21965.85/6275.33/3137.66) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1510.92 qps: 30222.87 (r/w/o: 21156.93/6044.09/3021.85) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1555.65 qps: 31111.52 (r/w/o: 21777.71/6222.50/3111.30) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1567.20 qps: 31339.55 (r/w/o: 21937.07/6268.19/3134.30) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 1544.73 qps: 30892.87 (r/w/o: 21624.50/6178.91/3089.46) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1559.42 qps: 31188.33 (r/w/o: 21831.90/6237.49/3118.94) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 1558.22 qps: 31168.14 (r/w/o: 21818.31/6233.39/3116.44) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1481.05 qps: 29620.42 (r/w/o: 20734.51/5923.80/2962.10) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1530.22 qps: 30604.63 (r/w/o: 21423.30/6120.99/3060.34) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1553.67 qps: 31072.06 (r/w/o: 21749.55/6215.07/3107.44) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 1551.33 qps: 31026.39 (r/w/o: 21719.12/6204.62/3102.66) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 1545.38 qps: 30911.48 (r/w/o: 21639.27/6181.44/3090.77) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 1566.50 qps: 31332.49 (r/w/o: 21931.96/6267.62/3132.91) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 1516.69 qps: 30330.91 (r/w/o: 21231.20/6066.24/3033.47) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 1547.61 qps: 30948.69 (r/w/o: 21663.13/6190.34/3095.22) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 1579.02 qps: 31586.16 (r/w/o: 22111.65/6316.57/3157.94) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 1555.29 qps: 31104.56 (r/w/o: 21772.93/6220.95/3110.68) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 1559.38 qps: 31180.71 (r/w/o: 21825.83/6236.22/3118.66) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 1570.03 qps: 31402.21 (r/w/o: 21980.95/6281.20/3140.05) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 1502.77 qps: 30056.05 (r/w/o: 21040.11/6010.29/3005.64) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 1552.22 qps: 31047.37 (r/w/o: 21733.56/6209.37/3104.44) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 1564.01 qps: 31278.09 (r/w/o: 21895.30/6254.76/3128.03) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 1562.09 qps: 31237.82 (r/w/o: 21864.97/6248.96/3123.88) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 1546.72 qps: 30940.19 (r/w/o: 21659.54/6186.90/3093.75) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 1576.25 qps: 31515.81 (r/w/o: 22059.03/6304.38/3152.39) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 1514.34 qps: 30293.99 (r/w/o: 21207.25/6058.06/3028.68) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 1531.55 qps: 30631.16 (r/w/o: 21441.97/6125.99/3063.20) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 1567.75 qps: 31356.12 (r/w/o: 21948.85/6271.78/3135.49) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 16 tps: 1568.84 qps: 31375.57 (r/w/o: 21962.71/6275.17/3137.69) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 16 tps: 1576.46 qps: 31529.10 (r/w/o: 22071.21/6304.96/3152.93) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 16 tps: 1561.26 qps: 31224.56 (r/w/o: 21856.99/6245.05/3122.53) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 16 tps: 1513.10 qps: 30264.10 (r/w/o: 21185.47/6052.42/3026.21) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 16 tps: 1575.01 qps: 31501.39 (r/w/o: 22050.63/6300.74/3150.02) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 16 tps: 1540.53 qps: 30802.26 (r/w/o: 21559.79/6161.91/3080.56) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7812518
        write:                           2232148
        other:                           1116074
        total:                           11160740
    transactions:                        558037 (1550.04 per sec.)
    queries:                             11160740 (31000.76 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          360.0133s
    total number of events:              558037

Latency (ms):
         min:                                    5.89
         avg:                                   10.32
         max:                                   82.87
         99th percentile:                       35.59
         sum:                              5757445.98

Threads fairness:
    events (avg/stddev):           34877.3125/1078.86
    execution time (avg/stddev):   359.8404/0.01

****************************** 32 threads ******************************
sysbench --db-driver=mysql --mysql-host=192.168.0.7 --mysql-port=3306 --mysql-user=sbtest --mysql-password=DBPassword123 --mysql-db=sbtest --table_size=10000000 --tables=10 --events=0 --time=360 --threads=32  --percentile=99  --report-interval=10 oltp_read_write run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 1696.65 qps: 33960.97 (r/w/o: 23776.98/6787.89/3396.10) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 1722.88 qps: 34459.54 (r/w/o: 24122.85/6890.63/3446.06) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 1745.64 qps: 34916.97 (r/w/o: 24441.41/6984.37/3491.19) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 1726.78 qps: 34536.17 (r/w/o: 24176.27/6906.23/3453.67) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 1728.27 qps: 34564.70 (r/w/o: 24195.98/6912.18/3456.54) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 1693.94 qps: 33876.76 (r/w/o: 23712.83/6775.95/3387.98) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 1718.70 qps: 34380.74 (r/w/o: 24067.63/6875.71/3437.40) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 1743.61 qps: 34862.40 (r/w/o: 24400.84/6974.44/3487.12) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 1741.86 qps: 34843.89 (r/w/o: 24391.61/6968.46/3483.83) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 1721.89 qps: 34436.15 (r/w/o: 24105.99/6886.47/3443.68) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 1737.01 qps: 34737.07 (r/w/o: 24314.62/6948.43/3474.02) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 1713.20 qps: 34259.19 (r/w/o: 23980.97/6851.92/3426.31) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 32 tps: 1709.31 qps: 34189.37 (r/w/o: 23932.42/6838.33/3418.62) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 1722.69 qps: 34460.56 (r/w/o: 24123.53/6891.55/3445.48) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 32 tps: 1700.51 qps: 34003.25 (r/w/o: 23802.28/6800.05/3400.93) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 1737.11 qps: 34750.10 (r/w/o: 24325.91/6949.76/3474.43) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 32 tps: 1734.45 qps: 34685.13 (r/w/o: 24278.95/6937.39/3468.79) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 1696.14 qps: 33920.26 (r/w/o: 23743.70/6784.37/3392.19) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 32 tps: 1716.40 qps: 34329.09 (r/w/o: 24028.99/6867.10/3433.00) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 1760.30 qps: 35207.57 (r/w/o: 24647.45/7039.51/3520.61) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 32 tps: 1729.20 qps: 34585.49 (r/w/o: 24209.16/6918.02/3458.31) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 1747.43 qps: 34946.90 (r/w/o: 24463.55/6988.50/3494.85) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 32 tps: 1750.04 qps: 35005.10 (r/w/o: 24503.83/7001.08/3500.19) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 1731.81 qps: 34634.35 (r/w/o: 24243.77/6927.15/3463.42) lat (ms,99%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 32 tps: 1761.97 qps: 35239.04 (r/w/o: 24666.74/7048.27/3524.03) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 1754.90 qps: 35097.80 (r/w/o: 24569.37/7018.52/3509.91) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 32 tps: 1727.35 qps: 34548.08 (r/w/o: 24182.58/6910.90/3454.60) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 1748.62 qps: 34974.20 (r/w/o: 24482.88/6994.08/3497.24) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 32 tps: 1756.45 qps: 35126.38 (r/w/o: 24587.65/7026.02/3512.71) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 1669.52 qps: 33395.60 (r/w/o: 23378.61/6677.76/3339.23) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 32 tps: 1732.61 qps: 34648.41 (r/w/o: 24252.65/6930.44/3465.32) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 1744.89 qps: 34895.97 (r/w/o: 24427.94/6978.35/3489.68) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 32 tps: 1726.93 qps: 34533.92 (r/w/o: 24172.87/6907.10/3453.95) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 1739.92 qps: 34799.03 (r/w/o: 24359.10/6960.19/3479.74) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 32 tps: 1750.28 qps: 35012.94 (r/w/o: 24510.18/7002.31/3500.45) lat (ms,99%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 1702.50 qps: 34049.13 (r/w/o: 23834.85/6809.09/3405.19) lat (ms,99%): 64.47 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8714342
        write:                           2489812
        other:                           1244906
        total:                           12449060
    transactions:                        622453 (1728.94 per sec.)
    queries:                             12449060 (34578.89 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          360.0173s
    total number of events:              622453

Latency (ms):
         min:                                    6.50
         avg:                                   18.50
         max:                                  115.81
         99th percentile:                       64.47
         sum:                             11517266.08

Threads fairness:
    events (avg/stddev):           19451.6562/374.84
    execution time (avg/stddev):   359.9146/0.01

****************************** 64 threads ******************************
sysbench --db-driver=mysql --mysql-host=192.168.0.7 --mysql-port=3306 --mysql-user=sbtest --mysql-password=DBPassword123 --mysql-db=sbtest --table_size=10000000 --tables=10 --events=0 --time=360 --threads=64  --percentile=99  --report-interval=10 oltp_read_write run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 1761.46 qps: 35305.12 (r/w/o: 24724.88/7050.93/3529.31) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 1787.99 qps: 35764.21 (r/w/o: 25036.10/7152.14/3575.97) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 1765.94 qps: 35316.71 (r/w/o: 24720.60/7064.24/3531.87) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 1789.39 qps: 35797.20 (r/w/o: 25057.19/7161.24/3578.77) lat (ms,99%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 1775.61 qps: 35510.67 (r/w/o: 24858.22/7101.23/3551.22) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 1775.68 qps: 35505.45 (r/w/o: 24853.98/7100.11/3551.35) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 1742.31 qps: 34845.99 (r/w/o: 24392.30/6969.06/3484.63) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 1745.80 qps: 34916.24 (r/w/o: 24440.63/6984.11/3491.50) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 1739.41 qps: 34794.84 (r/w/o: 24357.27/6958.65/3478.92) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 1735.50 qps: 34699.73 (r/w/o: 24290.05/6938.69/3470.99) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 1763.29 qps: 35269.07 (r/w/o: 24687.74/7054.75/3526.58) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 1769.22 qps: 35379.97 (r/w/o: 24766.13/7075.39/3538.45) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 64 tps: 1768.48 qps: 35385.06 (r/w/o: 24770.19/7077.91/3536.96) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 64 tps: 1765.69 qps: 35306.85 (r/w/o: 24714.39/7061.17/3531.28) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 64 tps: 1726.10 qps: 34524.85 (r/w/o: 24166.53/6906.01/3452.30) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 64 tps: 1757.21 qps: 35137.66 (r/w/o: 24596.21/7027.03/3514.42) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 64 tps: 1779.59 qps: 35593.45 (r/w/o: 24916.90/7117.47/3559.09) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 64 tps: 1761.51 qps: 35238.68 (r/w/o: 24665.70/7049.96/3523.03) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 64 tps: 1761.47 qps: 35220.44 (r/w/o: 24654.51/7042.89/3523.04) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 64 tps: 1758.37 qps: 35176.02 (r/w/o: 24623.63/7035.66/3516.73) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 64 tps: 1734.83 qps: 34695.55 (r/w/o: 24287.36/6938.53/3469.67) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 64 tps: 1760.52 qps: 35189.30 (r/w/o: 24631.55/7036.80/3520.95) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 64 tps: 1744.10 qps: 34892.99 (r/w/o: 24425.69/6979.30/3488.00) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 64 tps: 1766.98 qps: 35346.53 (r/w/o: 24743.17/7069.21/3534.15) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 64 tps: 1754.93 qps: 35094.15 (r/w/o: 24565.45/7018.93/3509.76) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 64 tps: 1779.88 qps: 35597.40 (r/w/o: 24918.19/7119.54/3559.67) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 64 tps: 1743.30 qps: 34873.50 (r/w/o: 24412.40/6974.20/3486.90) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 64 tps: 1764.20 qps: 35278.57 (r/w/o: 24694.35/7055.81/3528.41) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 64 tps: 1774.10 qps: 35493.54 (r/w/o: 24845.63/7099.71/3548.20) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 64 tps: 1766.49 qps: 35316.16 (r/w/o: 24720.33/7063.05/3532.78) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 64 tps: 1767.72 qps: 35354.72 (r/w/o: 24748.20/7070.88/3535.64) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 64 tps: 1767.20 qps: 35342.82 (r/w/o: 24741.12/7067.40/3534.30) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 64 tps: 1740.93 qps: 34819.64 (r/w/o: 24373.18/6964.61/3481.85) lat (ms,99%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 64 tps: 1755.09 qps: 35101.23 (r/w/o: 24568.61/7022.45/3510.17) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 64 tps: 1777.27 qps: 35541.07 (r/w/o: 24882.06/7104.47/3554.54) lat (ms,99%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 64 tps: 1770.96 qps: 35414.17 (r/w/o: 24786.72/7085.43/3542.02) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8876742
        write:                           2536212
        other:                           1268106
        total:                           12681060
    transactions:                        634053 (1761.07 per sec.)
    queries:                             12681060 (35221.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          360.0358s
    total number of events:              634053

Latency (ms):
         min:                                    7.60
         avg:                                   36.33
         max:                                  387.65
         99th percentile:                       86.00
         sum:                             23037869.58

Threads fairness:
    events (avg/stddev):           9907.0781/523.75
    execution time (avg/stddev):   359.9667/0.01

****************************** 128 threads ******************************
sysbench --db-driver=mysql --mysql-host=192.168.0.7 --mysql-port=3306 --mysql-user=sbtest --mysql-password=DBPassword123 --mysql-db=sbtest --table_size=10000000 --tables=10 --events=0 --time=360 --threads=128  --percentile=99  --report-interval=10 oltp_read_write run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 1724.62 qps: 34640.05 (r/w/o: 24269.44/6908.77/3461.84) lat (ms,99%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 1784.75 qps: 35700.41 (r/w/o: 24992.14/7138.68/3569.59) lat (ms,99%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 1776.41 qps: 35532.44 (r/w/o: 24872.10/7107.43/3552.91) lat (ms,99%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 1771.20 qps: 35421.26 (r/w/o: 24793.37/7085.59/3542.30) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 1755.50 qps: 35110.03 (r/w/o: 24573.22/7025.71/3511.10) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 1741.89 qps: 34832.87 (r/w/o: 24386.81/6962.47/3483.59) lat (ms,99%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 1763.91 qps: 35278.77 (r/w/o: 24693.82/7057.23/3527.72) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 1780.56 qps: 35597.72 (r/w/o: 24921.85/7114.74/3561.12) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 1783.55 qps: 35683.63 (r/w/o: 24975.82/7140.71/3567.10) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 1768.27 qps: 35374.98 (r/w/o: 24763.17/7075.08/3536.74) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 1719.40 qps: 34374.88 (r/w/o: 24061.88/6874.40/3438.60) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 1717.21 qps: 34359.86 (r/w/o: 24052.58/6872.65/3434.63) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 128 tps: 1737.60 qps: 34739.09 (r/w/o: 24317.06/6947.02/3475.01) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 128 tps: 1730.69 qps: 34618.65 (r/w/o: 24233.50/6923.67/3461.49) lat (ms,99%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 128 tps: 1748.91 qps: 34967.05 (r/w/o: 24475.30/6993.93/3497.81) lat (ms,99%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 128 tps: 1740.31 qps: 34809.88 (r/w/o: 24370.19/6959.06/3480.63) lat (ms,99%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 128 tps: 1753.09 qps: 35059.28 (r/w/o: 24541.02/7012.08/3506.19) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 128 tps: 1742.89 qps: 34860.02 (r/w/o: 24402.10/6972.04/3485.87) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 128 tps: 1752.17 qps: 35048.91 (r/w/o: 24534.32/7010.26/3504.33) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 128 tps: 1756.13 qps: 35115.29 (r/w/o: 24577.08/7025.94/3512.27) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 128 tps: 1751.11 qps: 35024.29 (r/w/o: 24518.83/7003.34/3502.12) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 128 tps: 1755.29 qps: 35103.23 (r/w/o: 24572.48/7020.37/3510.38) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 128 tps: 1734.20 qps: 34700.84 (r/w/o: 24290.63/6941.51/3468.70) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 128 tps: 1743.11 qps: 34854.01 (r/w/o: 24397.38/6970.32/3486.31) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 128 tps: 1758.30 qps: 35163.42 (r/w/o: 24613.21/7033.80/3516.40) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 128 tps: 1772.00 qps: 35440.21 (r/w/o: 24808.54/7087.68/3543.99) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 128 tps: 1775.57 qps: 35506.83 (r/w/o: 24856.00/7099.79/3551.04) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 128 tps: 1765.84 qps: 35321.53 (r/w/o: 24726.48/7063.17/3531.88) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 128 tps: 1743.80 qps: 34870.21 (r/w/o: 24405.71/6977.00/3487.50) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 128 tps: 1739.58 qps: 34802.05 (r/w/o: 24365.26/6957.43/3479.37) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 128 tps: 1737.41 qps: 34749.02 (r/w/o: 24324.55/6949.84/3474.62) lat (ms,99%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 128 tps: 1748.20 qps: 34947.78 (r/w/o: 24458.65/6992.82/3496.31) lat (ms,99%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 128 tps: 1763.99 qps: 35277.74 (r/w/o: 24697.52/7051.95/3528.27) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 128 tps: 1769.61 qps: 35407.70 (r/w/o: 24783.41/7085.06/3539.23) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 128 tps: 1740.48 qps: 34793.95 (r/w/o: 24355.45/6957.83/3480.66) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 128 tps: 1753.02 qps: 35072.90 (r/w/o: 24554.88/7011.78/3506.24) lat (ms,99%): 183.21 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8835918
        write:                           2524548
        other:                           1262274
        total:                           12622740
    transactions:                        631137 (1752.78 per sec.)
    queries:                             12622740 (35055.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          360.0767s
    total number of events:              631137

Latency (ms):
         min:                                    7.69
         avg:                                   73.01
         max:                                  487.94
         99th percentile:                      186.54
         sum:                             46079420.33

Threads fairness:
    events (avg/stddev):           4930.7578/120.24
    execution time (avg/stddev):   359.9955/0.02